#### commenting methods

In [ ]:
/* .......
 ........
    .......*/
    
#single line comment
--line of code

#### Data Selection _Simplest

In [ ]:
select column_01
from Table_01

In [ ]:
select column_01 ,column_02
from Table_01
limit 5; #limited to only 5 data from the db

#### Filter

In [ ]:
select col_01 ,col_02
from table_01
where col_01 > 10;

In [ ]:
=   equal
<>  not equal
> / < greater than /less than
>= greater than or equal to
<= less than or equal to
BETWEEN  #Inbetween two digits 
       eg :WHERE col_1 BETWEEN 15 And 25;
IS NULL   #select a null value for conditions

##### IN operator

In [ ]:
this will filter wrt the input in the list

In [ ]:
select col_1,col_2
from table_1
where col_1 IN ('k','l','o','p');

###### OR Operator

In [ ]:
select col_1
from table_1
where col_2 = 'A'  OR 'B'
#If first condition meets then it will not go to check second and return the result

###### AND operator

In the below example without paranthesis, the and and or execute seperately and give the result meeting both the condiion

In [ ]:
select col_1
from table_1
where col_1 =10 OR col_1 =5
And col_2 < 100 ;

In case if we need to filter Or filter first and inside that resultant data need to apply and followed condition 
then include a paranthesis

In [ ]:
select col_1
from table_1
where (col_1 =10 OR col_1 =5)
And col_2 < 100 ;

#### NOT operator

In [ ]:
select col_1
from table_1
where NOT col_1= 'A' And  not col_1 ='C';

##### WILD CARDS

%wor    select all the data ends with wor
wor%    select all the data starts with wor
%wor%   select all the data before and after wor
a%P     slect all starts with a and ends with p
Wild cards will not work with null
wildcards takes longer to run compared to other operators like =,>,<, etc

In [ ]:
select col_1
from table_1
where col_1 LIKE %ent

##### SORT

In [ ]:
select col_1
from table_1
where col_1 = 15
order by col_3 ASC ; #ascending order

In [ ]:
select col_1
from table_1
where col_1 = 15
order by col_3 DESC ; #Descending order

In [ ]:
select col_1
from table_1
where col_1 = 15
order by 2,3,4 DESC ; #Descending order
#order by 2nd column then 3rd column etc

##### Combining columns or apply math over values

In [ ]:
select col_1 ,
       col_1 *col_2 as col_mult
from table_1 

#creating third column by applying math between columns

In [ ]:
select col_1 ,
       col_1 *2 as col_double
from table_1 

#creating third column by applying math operation with numbericals

### Grouping

below comment will group the table wrt the repetative value of col_2, similar to groupby function inpandsas

In [ ]:
select col_1,col_2
from table_1
group by col_3;

#### Applying Aggregate with groupby

In [ ]:
select col_3 ,count (col_1) as count_col_1
from table_1
group by col_3

Above code will group the table_1 wrt the col_3, and appplying count will return the number of records in each group
to get this result we can add any col excep the col used to group by ie:col_3

In [ ]:
select col_3 ,sum (col_1) as total_col_1
from table_1
group by col_3

Above code will group the table_1 wrt the col_3, and appplying sum will return the sum of records of col_1 in each group

##### HAVING function with Groupby

In [ ]:
select col_1,col_2 ,count (col_2) as col_1_count
from table_1
group by col_1
having col_1_count > 15;

#### SUB Query

### Applying Aggregate Function

###### Count

Count with null value

In [ ]:
select count(*) as total_counts
from table_1

Count without null value

In [ ]:
select count(col_1) as total_Nonnull
from table_1

##### MAX /MIn /SUM/ AVG

In [ ]:
select sum(col_1) as total_col_1
from table_1   #sum of all the values in col_1

In [ ]:
select max(col_1) as max_col_1
from table_1 #max value in col_1

In [ ]:
select min(col_1) as min_col_1
from table_1 #min val in col_1

###### Distince Function

If not mentioned mysql will return all the values , including the repetative values
if distinct mentioned it will return only the unique values

In [ ]:
select distinct col_3
from table_1

In [ ]:
select count(distinct col_3)
from table_1

# CLEVER CLOUD

In [28]:
#!pip3 install mysql-connector-python

In [1]:
import mysql.connector
import pandas as pd

In [2]:


connection = mysql.connector.connect(
  host="b8rzawgklevuix0zi5mu-mysql.services.clever-cloud.com", # replace username, hostname, password and database name appropriately
  user="uof0m19h2v9tclea",
  password="1Qm5vnauBiqPLB4KtlZI",
  database="b8rzawgklevuix0zi5mu"
)

cursor1 = connection.cursor()

In [3]:
#cursor1.execute("CREATE TABLE Test_table (name VARCHAR(255), place VARCHAR(255))")

In [4]:
cursor1.execute("SHOW TABLES")

for x in cursor1:
    print(x)

('TRAIL_DA',)
('Test_table',)

In [5]:
#cursor1.execute("CREATE TABLE subject (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), teacher VARCHAR(255))")

In [6]:
#cursor1.execute("ALTER TABLE Test_table ADD COLUMN id INT AUTO_INCREMENT PRIMARY KEY")

In [7]:
cursor1.execute("ALTER TABLE Test_table  AUTO_INCREMENT=0")

#### INSERT TUPLES INTO THE DF

In [8]:
sql="INSERT INTO Test_table (name,place) VALUES (%s ,%s)"  #insert a single tuple
val=('Kiran','Pune')

cursor1.execute(sql,val)

In [9]:
connection.commit()
print(cursor1.rowcount,"tuple inserted")

1 tuple inserted

In [10]:
cursor1.execute()

TypeError: execute() missing 1 required positional argument: 'operation'

In [11]:
#cursor1 = connection.cursor()
sql="INSERT INTO Test_table(name,place) VALUES (%s,%s)"

val=[('christina','Cov'),
    ('Sharlene','Cov')]

cursor1.executemany(sql,val)

In [12]:
print(cursor1.rowcount,'tuple were inserted')

2 tuple were inserted

#### SELECT DATA FROM A TABLE

In [25]:
cursor1.execute("SELECT * FROM Test_table")

In [14]:
result1 =cursor1.fetchone()   #fetch the first tuple
print(result1)

('Kiran', 'Pune', 1)

In [15]:
result2=cursor1.fetchall()   #fetch all the tuple

for i in result2:
    print(i)

('christina', 'Cov', 2)
('Sharlene', 'Cov', 3)
('Kiran', 'Pune', 4)
('Kiran', 'Pune', 5)
('Kiran', 'Pune', 6)
('christina', 'Cov', 7)
('Sharlene', 'Cov', 8)
('Kiran', 'Pune', 9)
('christina', 'Cov', 10)
('Sharlene', 'Cov', 11)

In [16]:
cursor1.execute("SELECT name FROM Test_table")

myresult3 =cursor1.fetchall()

for i in myresult3:
    print(i)

('Kiran',)
('christina',)
('Sharlene',)
('Kiran',)
('Kiran',)
('Kiran',)
('christina',)
('Sharlene',)
('Kiran',)
('christina',)
('Sharlene',)

In [17]:
cursor1.execute("SELECT place FROM Test_table")

myresult4 =cursor1.fetchall()

for i in myresult4:
    print(i)

('Pune',)
('Cov',)
('Cov',)
('Pune',)
('Pune',)
('Pune',)
('Cov',)
('Cov',)
('Pune',)
('Cov',)
('Cov',)

In [18]:
cursor1.execute("SELECT name ,place FROM Test_table")
myresult5 =cursor1.fetchall()

for i in myresult5:
    print(i)

('Kiran', 'Pune')
('christina', 'Cov')
('Sharlene', 'Cov')
('Kiran', 'Pune')
('Kiran', 'Pune')
('Kiran', 'Pune')
('christina', 'Cov')
('Sharlene', 'Cov')
('Kiran', 'Pune')
('christina', 'Cov')
('Sharlene', 'Cov')

#### Limit the Display

In [19]:
cursor1.execute( "SELECT * FROM Test_table LIMIT 2")  #show only two results

result2 =cursor1.fetchall()

for x in result2:
    print(x)

('Kiran', 'Pune', 1)
('christina', 'Cov', 2)

#### Filter Application

In [20]:
funct1="SELECT name ,place FROM Test_table WHERE name ='Kiran'"
cursor1.execute(funct1)
result_6 =cursor1.fetchall()

for i in result_6:
    print(i)

('Kiran', 'Pune')
('Kiran', 'Pune')
('Kiran', 'Pune')
('Kiran', 'Pune')
('Kiran', 'Pune')

In [21]:
print(result_6)

[('Kiran', 'Pune'), ('Kiran', 'Pune'), ('Kiran', 'Pune'), ('Kiran', 'Pune'), ('Kiran', 'Pune')]

#### Delete Tuples

In [22]:
funct2= "DELETE FROM Test_table WHERE name ='Kiran'"

cursor1.execute(funct2)

print(cursor1.rowcount, "are delected")

5 are delected

#### Fetch Data with Filter

In [23]:
funct4="SELECT count(*) FROM Test_table WHERE name ='Christina'"

cursor1.execute(funct4)

result4=cursor1.fetchall()

for i in result4:
    print(i)

(3,)

#### Table Updation

In [33]:
funct5="UPDATE Test_table SET name ='kc' WHERE name ='Kiran'"

cursor1.execute(funct5)

print(cursor1.rowcount, 'are affected')

3 are affected

In [34]:
#to check the table for changes
funt1="SELECT name ,place FROM Test_table "
cursor1.execute(funt1)
result_6 =cursor1.fetchall()

for i in result_6:
    print(i)

('kc', 'Pune')
('Christina C', 'Cov')
('Sharlene', 'Cov')
('kc', 'Pune')
('kc', 'Pune')

#### Count the data in the Table

In [17]:
filt3= "SELECT count(*) FROM Test_table"

cursor1.execute(filt3)

result3 =cursor1.fetchall()

for x in result3:
        print(x)

(2,)

#### CONVERT INTO PANDAS DF FOR ANALYSIS

In [66]:
print(result2)

[('christina', 'Cov', 2), ('Sharlene', 'Cov', 3), ('Kiran', 'Pune', 4), ('Kiran', 'Pune', 5), ('Kiran', 'Pune', 6), ('christina', 'Cov', 7), ('Sharlene', 'Cov', 8)]

In [74]:
col1=list(zip(result2))  #this is just to show the difference of list creation without the * in the command
col1

[(('christina', 'Cov', 2),),
 (('Sharlene', 'Cov', 3),),
 (('Kiran', 'Pune', 4),),
 (('Kiran', 'Pune', 5),),
 (('Kiran', 'Pune', 6),),
 (('christina', 'Cov', 7),),
 (('Sharlene', 'Cov', 8),)]

In [75]:
col2=list(zip(*result2))
col2

[('christina', 'Sharlene', 'Kiran', 'Kiran', 'Kiran', 'christina', 'Sharlene'),
 ('Cov', 'Cov', 'Pune', 'Pune', 'Pune', 'Cov', 'Cov'),
 (2, 3, 4, 5, 6, 7, 8)]

In [79]:
df=pd.DataFrame({'name':col2[0],'address':col2[1]})

In [80]:
df

        name address
0  christina     Cov
1   Sharlene     Cov
2      Kiran    Pune
3      Kiran    Pune
4      Kiran    Pune
5  christina     Cov
6   Sharlene     Cov

#### Table Delection

In [81]:
funct6= "DROP TABLE subject "
#funct6 ="DROP TABLE IF EXISTS subject"
cursor1.execute(funct6)

In [82]:
#to display the table in db
cursor1.execute("SHOW TABLES") 

for x in cursor1:
    print(x)

('Test_table',)